# IsCoverOffsetValid Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricArea..::..IsCoverOffsetValid Method
FabricArea Class See Also
---
Identifies if the specified value is valid for use as a cover offset.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public bool IsCoverOffsetValid(
	double coverOffset
)
```

Visual Basic
---
```text
Public Function IsCoverOffsetValid ( _
	coverOffset As Double _
) As Boolean
```

Visual C++
---
```text
public:
bool IsCoverOffsetValid(
	double coverOffset
)
```

# ### Parameters
coverOffset
    Type: System..::..Double The cover offset value.
# ### Return Value
True if the value is valid, false if the value is invalid.
# Remarks
The cover offset must be less than or equal to the host thickness.
# See Also
FabricArea Class
Autodesk.Revit.DB.Structure Namespace